results/r6g-b_rw.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 2269.47 qps: 45433.54 (r/w/o: 31810.87/9079.53/4543.14) lat (ms,95%): 38.94 err/s: 1.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2272.08 qps: 45483.67 (r/w/o: 31837.28/9101.67/4544.71) lat (ms,95%): 50.11 err/s: 0.55 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2358.55 qps: 47172.78 (r/w/o: 33026.04/9429.20/4717.55) lat (ms,95%): 42.61 err/s: 0.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2426.08 qps: 48496.14 (r/w/o: 33944.48/9698.79/4852.87) lat (ms,95%): 33.72 err/s: 0.75 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2363.59 qps: 47276.63 (r/w/o: 33093.79/9455.26/4727.58) lat (ms,95%): 39.65 err/s: 0.45 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2363.03 qps: 47317.96 (r/w/o: 33125.44/9465.71/4726.81) lat (ms,95%): 43.39 err/s: 0.65 reconn/s: 0.00
[ 140s ] thds: 64 tps: 2380.50 qps: 47620.07 (r/w/o: 33335.38/9523.09/4761.60) lat (ms,95%): 40.37 err/s: 0.60 reconn/s: 0.00
[ 160s ] thds: 64 tps: 2418.97 qps: 48342.73 (r/w/o: 33839.59/9664.65/4838.50) lat (ms,95%): 36.24 err/s: 0.55 reconn/s: 0.00
[ 180s ] thds: 64 tps: 2434.67 qps: 48736.17 (r/w/o: 34123.03/9743.34/4869.80) lat (ms,95%): 34.95 err/s: 0.45 reconn/s: 0.00
[ 200s ] thds: 64 tps: 2450.00 qps: 49013.05 (r/w/o: 34307.47/9805.19/4900.40) lat (ms,95%): 35.59 err/s: 0.40 reconn/s: 0.00
[ 220s ] thds: 64 tps: 2440.98 qps: 48814.63 (r/w/o: 34177.02/9755.34/4882.27) lat (ms,95%): 40.37 err/s: 0.30 reconn/s: 0.00
[ 240s ] thds: 64 tps: 2428.16 qps: 48593.22 (r/w/o: 34009.09/9726.85/4857.28) lat (ms,95%): 44.17 err/s: 0.95 reconn/s: 0.00
[ 260s ] thds: 64 tps: 2461.59 qps: 49217.84 (r/w/o: 34455.17/9838.83/4923.84) lat (ms,95%): 32.53 err/s: 0.65 reconn/s: 0.00
[ 280s ] thds: 64 tps: 2447.70 qps: 48984.22 (r/w/o: 34294.14/9793.63/4896.44) lat (ms,95%): 39.65 err/s: 1.05 reconn/s: 0.00
[ 300s ] thds: 64 tps: 2473.85 qps: 49490.73 (r/w/o: 34649.82/9892.21/4948.70) lat (ms,95%): 38.94 err/s: 1.00 reconn/s: 0.00
[ 320s ] thds: 64 tps: 2473.05 qps: 49459.07 (r/w/o: 34619.51/9892.90/4946.65) lat (ms,95%): 34.95 err/s: 0.55 reconn/s: 0.00
[ 340s ] thds: 64 tps: 2504.96 qps: 50132.49 (r/w/o: 35092.45/10029.43/5010.61) lat (ms,95%): 35.59 err/s: 0.70 reconn/s: 0.00
[ 360s ] thds: 64 tps: 2457.58 qps: 49132.03 (r/w/o: 34392.26/9825.47/4914.31) lat (ms,95%): 40.37 err/s: 1.15 reconn/s: 0.00
[ 380s ] thds: 64 tps: 2459.68 qps: 49239.08 (r/w/o: 34472.27/9844.74/4922.07) lat (ms,95%): 40.37 err/s: 0.70 reconn/s: 0.00
[ 400s ] thds: 64 tps: 2482.08 qps: 49629.54 (r/w/o: 34742.53/9922.36/4964.65) lat (ms,95%): 40.37 err/s: 0.55 reconn/s: 0.00
[ 420s ] thds: 64 tps: 2554.38 qps: 51083.04 (r/w/o: 35754.68/10218.74/5109.62) lat (ms,95%): 31.94 err/s: 0.80 reconn/s: 0.00
[ 440s ] thds: 64 tps: 2515.49 qps: 50321.49 (r/w/o: 35226.97/10062.88/5031.64) lat (ms,95%): 32.53 err/s: 0.70 reconn/s: 0.00
[ 460s ] thds: 64 tps: 2523.45 qps: 50519.15 (r/w/o: 35369.55/10101.90/5047.70) lat (ms,95%): 37.56 err/s: 0.75 reconn/s: 0.00
[ 480s ] thds: 64 tps: 2528.14 qps: 50577.86 (r/w/o: 35407.60/10113.07/5057.19) lat (ms,95%): 35.59 err/s: 0.90 reconn/s: 0.00
[ 500s ] thds: 64 tps: 2518.35 qps: 50374.73 (r/w/o: 35266.42/10071.16/5037.15) lat (ms,95%): 38.25 err/s: 0.45 reconn/s: 0.00
[ 520s ] thds: 64 tps: 2491.39 qps: 49846.77 (r/w/o: 34889.81/9973.37/4983.59) lat (ms,95%): 42.61 err/s: 0.80 reconn/s: 0.00
[ 540s ] thds: 64 tps: 2538.43 qps: 50766.64 (r/w/o: 35542.38/10146.84/5077.42) lat (ms,95%): 34.33 err/s: 0.90 reconn/s: 0.00
[ 560s ] thds: 64 tps: 2550.18 qps: 50996.09 (r/w/o: 35694.58/10200.49/5101.02) lat (ms,95%): 34.33 err/s: 0.50 reconn/s: 0.00
[ 580s ] thds: 64 tps: 2544.32 qps: 50906.04 (r/w/o: 35636.56/10179.54/5089.94) lat (ms,95%): 33.12 err/s: 1.10 reconn/s: 0.00
[ 600s ] thds: 64 tps: 2567.19 qps: 51347.21 (r/w/o: 35943.69/10270.40/5133.13) lat (ms,95%): 33.12 err/s: 0.60 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20642230
        write:                           5896777
        other:                           2948471
        total:                           29487478
    transactions:                        1474026 (2455.78 per sec.)
    queries:                             29487478 (49127.23 per sec.)
    ignored errors:                      419    (0.70 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.2256s
    total number of events:              1474026

Latency (ms):
         min:                                    6.83
         avg:                                   26.05
         max:                                  885.92
         95th percentile:                       37.56
         sum:                             38400860.63

Threads fairness:
    events (avg/stddev):           23031.6562/85.69
    execution time (avg/stddev):   600.0134/0.05