results/r6g-b_rw_256.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 256 tps: 2793.96 qps: 56084.53 (r/w/o: 39284.68/11198.79/5601.07) lat (ms,95%): 123.28 err/s: 1.95 reconn/s: 0.00
[ 40s ] thds: 256 tps: 2812.45 qps: 56266.81 (r/w/o: 39382.70/11259.15/5624.95) lat (ms,95%): 127.81 err/s: 2.10 reconn/s: 0.00
[ 60s ] thds: 256 tps: 2808.47 qps: 56252.56 (r/w/o: 39390.42/11238.61/5623.53) lat (ms,95%): 130.13 err/s: 2.95 reconn/s: 0.00
[ 80s ] thds: 256 tps: 2945.88 qps: 58929.82 (r/w/o: 41260.42/11774.83/5894.57) lat (ms,95%): 112.67 err/s: 3.25 reconn/s: 0.00
[ 100s ] thds: 256 tps: 2903.09 qps: 58037.73 (r/w/o: 40621.16/11615.25/5801.32) lat (ms,95%): 125.52 err/s: 3.00 reconn/s: 0.00
[ 120s ] thds: 256 tps: 2938.51 qps: 58922.35 (r/w/o: 41286.68/11746.85/5888.83) lat (ms,95%): 116.80 err/s: 3.50 reconn/s: 0.00
[ 140s ] thds: 256 tps: 2973.65 qps: 59563.99 (r/w/o: 41692.17/11921.07/5950.76) lat (ms,95%): 116.80 err/s: 3.45 reconn/s: 0.00
[ 160s ] thds: 256 tps: 2914.09 qps: 58306.18 (r/w/o: 40832.03/11642.87/5831.28) lat (ms,95%): 127.81 err/s: 3.10 reconn/s: 0.00
[ 180s ] thds: 256 tps: 2987.27 qps: 59774.43 (r/w/o: 41828.99/11968.20/5977.25) lat (ms,95%): 116.80 err/s: 2.70 reconn/s: 0.00
[ 200s ] thds: 256 tps: 2981.33 qps: 59724.99 (r/w/o: 41823.96/11934.97/5966.06) lat (ms,95%): 116.80 err/s: 3.40 reconn/s: 0.00
[ 220s ] thds: 256 tps: 2977.44 qps: 59484.49 (r/w/o: 41631.43/11901.43/5951.64) lat (ms,95%): 123.28 err/s: 3.60 reconn/s: 0.00
[ 240s ] thds: 256 tps: 2964.40 qps: 59453.18 (r/w/o: 41637.25/11876.84/5939.09) lat (ms,95%): 121.08 err/s: 3.45 reconn/s: 0.00
[ 260s ] thds: 256 tps: 3031.42 qps: 60676.84 (r/w/o: 42492.37/12119.68/6064.79) lat (ms,95%): 116.80 err/s: 3.15 reconn/s: 0.00
[ 280s ] thds: 256 tps: 2956.94 qps: 59154.15 (r/w/o: 41406.49/11832.72/5914.93) lat (ms,95%): 125.52 err/s: 2.65 reconn/s: 0.00
[ 300s ] thds: 256 tps: 3036.88 qps: 60761.92 (r/w/o: 42518.61/12164.10/6079.20) lat (ms,95%): 112.67 err/s: 2.70 reconn/s: 0.00
[ 320s ] thds: 256 tps: 3040.71 qps: 60842.06 (r/w/o: 42620.61/12140.38/6081.07) lat (ms,95%): 116.80 err/s: 3.00 reconn/s: 0.00
[ 340s ] thds: 256 tps: 2976.07 qps: 59593.35 (r/w/o: 41727.48/11910.58/5955.29) lat (ms,95%): 123.28 err/s: 2.65 reconn/s: 0.00
[ 360s ] thds: 256 tps: 3049.58 qps: 61099.71 (r/w/o: 42755.36/12239.55/6104.80) lat (ms,95%): 116.80 err/s: 2.75 reconn/s: 0.00
[ 380s ] thds: 256 tps: 3006.27 qps: 60171.96 (r/w/o: 42147.93/12008.64/6015.40) lat (ms,95%): 116.80 err/s: 2.85 reconn/s: 0.00
[ 400s ] thds: 256 tps: 2991.28 qps: 59803.50 (r/w/o: 41854.60/11963.65/5985.25) lat (ms,95%): 121.08 err/s: 2.70 reconn/s: 0.00
[ 420s ] thds: 256 tps: 2984.08 qps: 59658.16 (r/w/o: 41760.91/11926.28/5970.97) lat (ms,95%): 125.52 err/s: 2.80 reconn/s: 0.00
[ 440s ] thds: 256 tps: 3055.42 qps: 61304.39 (r/w/o: 42921.74/12269.90/6112.75) lat (ms,95%): 114.72 err/s: 3.25 reconn/s: 0.00
[ 460s ] thds: 256 tps: 3040.86 qps: 60832.38 (r/w/o: 42620.66/12125.05/6086.67) lat (ms,95%): 116.80 err/s: 3.60 reconn/s: 0.00
[ 480s ] thds: 256 tps: 3083.09 qps: 61639.60 (r/w/o: 43122.98/12347.90/6168.73) lat (ms,95%): 112.67 err/s: 2.55 reconn/s: 0.00
[ 500s ] thds: 256 tps: 3012.99 qps: 60332.35 (r/w/o: 42245.42/12057.80/6029.12) lat (ms,95%): 118.92 err/s: 3.15 reconn/s: 0.00
[ 520s ] thds: 256 tps: 3091.13 qps: 61944.11 (r/w/o: 43379.26/12379.95/6184.90) lat (ms,95%): 112.67 err/s: 2.65 reconn/s: 0.00
[ 540s ] thds: 256 tps: 3020.46 qps: 60437.72 (r/w/o: 42321.26/12072.64/6043.82) lat (ms,95%): 118.92 err/s: 2.95 reconn/s: 0.00
[ 560s ] thds: 256 tps: 3047.10 qps: 60991.48 (r/w/o: 42684.42/12211.21/6095.85) lat (ms,95%): 114.72 err/s: 2.75 reconn/s: 0.00
[ 580s ] thds: 256 tps: 3053.99 qps: 61111.13 (r/w/o: 42792.92/12206.03/6112.19) lat (ms,95%): 116.80 err/s: 3.05 reconn/s: 0.00
[ 600s ] thds: 256 tps: 2993.41 qps: 59990.28 (r/w/o: 41989.29/12010.98/5990.01) lat (ms,95%): 121.08 err/s: 3.20 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            25080734
        write:                           7161332
        other:                           3581185
        total:                           35823251
    transactions:                        1789704 (2979.16 per sec.)
    queries:                             35823251 (59631.83 per sec.)
    ignored errors:                      1777   (2.96 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.7392s
    total number of events:              1789704

Latency (ms):
         min:                                    8.36
         avg:                                   85.84
         max:                                  402.20
         95th percentile:                      118.92
         sum:                            153627036.46

Threads fairness:
    events (avg/stddev):           6991.0312/36.56
    execution time (avg/stddev):   600.1056/0.09