results/r6g-b_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 4854.12 qps: 29132.38 (r/w/o: 0.00/19419.69/9712.69) lat (ms,95%): 18.28 err/s: 1.50 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5168.06 qps: 31015.08 (r/w/o: 0.00/20676.77/10338.31) lat (ms,95%): 16.71 err/s: 2.05 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5113.76 qps: 30690.03 (r/w/o: 0.00/20460.86/10229.18) lat (ms,95%): 17.32 err/s: 1.55 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5205.09 qps: 31243.82 (r/w/o: 0.00/20831.63/10412.19) lat (ms,95%): 17.63 err/s: 2.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 5312.30 qps: 31878.75 (r/w/o: 0.00/21252.65/10626.10) lat (ms,95%): 15.55 err/s: 1.50 reconn/s: 0.00
[ 120s ] thds: 64 tps: 5234.79 qps: 31408.05 (r/w/o: 0.00/20936.52/10471.53) lat (ms,95%): 17.01 err/s: 1.95 reconn/s: 0.00
[ 140s ] thds: 64 tps: 5287.41 qps: 31735.70 (r/w/o: 0.00/21159.18/10576.52) lat (ms,95%): 16.71 err/s: 1.70 reconn/s: 0.00
[ 160s ] thds: 64 tps: 5271.70 qps: 31630.28 (r/w/o: 0.00/21084.98/10545.29) lat (ms,95%): 16.71 err/s: 1.90 reconn/s: 0.00
[ 180s ] thds: 64 tps: 5250.00 qps: 31504.14 (r/w/o: 0.00/21002.19/10501.95) lat (ms,95%): 17.32 err/s: 1.95 reconn/s: 0.00
[ 200s ] thds: 64 tps: 5288.50 qps: 31743.08 (r/w/o: 0.00/21164.12/10578.96) lat (ms,95%): 16.71 err/s: 1.95 reconn/s: 0.00
[ 220s ] thds: 64 tps: 5376.30 qps: 32263.42 (r/w/o: 0.00/21508.81/10754.61) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 240s ] thds: 64 tps: 5302.80 qps: 31821.64 (r/w/o: 0.00/21214.35/10607.30) lat (ms,95%): 16.71 err/s: 1.70 reconn/s: 0.00
[ 260s ] thds: 64 tps: 5330.89 qps: 31990.07 (r/w/o: 0.00/21326.05/10664.02) lat (ms,95%): 15.83 err/s: 2.25 reconn/s: 0.00
[ 280s ] thds: 64 tps: 5351.86 qps: 32118.48 (r/w/o: 0.00/21412.65/10705.83) lat (ms,95%): 15.83 err/s: 2.10 reconn/s: 0.00
[ 300s ] thds: 64 tps: 5307.96 qps: 31845.00 (r/w/o: 0.00/21226.78/10618.22) lat (ms,95%): 16.12 err/s: 2.30 reconn/s: 0.00
[ 320s ] thds: 64 tps: 5289.25 qps: 31750.13 (r/w/o: 0.00/21169.72/10580.41) lat (ms,95%): 16.71 err/s: 1.90 reconn/s: 0.00
[ 340s ] thds: 64 tps: 5336.23 qps: 32022.80 (r/w/o: 0.00/21348.43/10674.37) lat (ms,95%): 16.41 err/s: 1.90 reconn/s: 0.00
[ 360s ] thds: 64 tps: 5328.00 qps: 31973.05 (r/w/o: 0.00/21315.20/10657.85) lat (ms,95%): 16.71 err/s: 1.85 reconn/s: 0.00
[ 380s ] thds: 64 tps: 5332.86 qps: 31989.27 (r/w/o: 0.00/21324.20/10665.07) lat (ms,95%): 16.71 err/s: 2.15 reconn/s: 0.00
[ 400s ] thds: 64 tps: 5333.75 qps: 32008.55 (r/w/o: 0.00/21337.10/10671.45) lat (ms,95%): 15.83 err/s: 1.85 reconn/s: 0.00
[ 420s ] thds: 64 tps: 5323.03 qps: 31956.93 (r/w/o: 0.00/21308.27/10648.66) lat (ms,95%): 16.41 err/s: 1.90 reconn/s: 0.00
[ 440s ] thds: 64 tps: 5291.66 qps: 31755.25 (r/w/o: 0.00/21170.03/10585.22) lat (ms,95%): 17.63 err/s: 1.90 reconn/s: 0.00
[ 460s ] thds: 64 tps: 5363.50 qps: 32186.25 (r/w/o: 0.00/21457.40/10728.85) lat (ms,95%): 16.12 err/s: 1.85 reconn/s: 0.00
[ 480s ] thds: 64 tps: 5439.24 qps: 32626.57 (r/w/o: 0.00/21747.48/10879.09) lat (ms,95%): 15.83 err/s: 1.45 reconn/s: 0.00
[ 500s ] thds: 64 tps: 5373.04 qps: 32249.89 (r/w/o: 0.00/21501.31/10748.58) lat (ms,95%): 16.41 err/s: 1.65 reconn/s: 0.00
[ 520s ] thds: 64 tps: 5368.36 qps: 32218.83 (r/w/o: 0.00/21480.15/10738.68) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 540s ] thds: 64 tps: 5359.89 qps: 32155.31 (r/w/o: 0.00/21433.62/10721.69) lat (ms,95%): 17.01 err/s: 2.00 reconn/s: 0.00
[ 560s ] thds: 64 tps: 5349.40 qps: 32113.87 (r/w/o: 0.00/21413.03/10700.84) lat (ms,95%): 16.41 err/s: 1.90 reconn/s: 0.00
[ 580s ] thds: 64 tps: 5393.16 qps: 32349.13 (r/w/o: 0.00/21563.95/10785.18) lat (ms,95%): 16.71 err/s: 1.85 reconn/s: 0.00
[ 600s ] thds: 64 tps: 5388.49 qps: 32350.21 (r/w/o: 0.00/21568.62/10781.59) lat (ms,95%): 15.83 err/s: 1.60 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           12716363
        other:                           6358281
        total:                           19074644
    transactions:                        3178579 (5297.02 per sec.)
    queries:                             19074644 (31787.41 per sec.)
    ignored errors:                      1123   (1.87 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0680s
    total number of events:              3178579

Latency (ms):
         min:                                    3.24
         avg:                                   12.08
         max:                                  176.57
         95th percentile:                       16.71
         sum:                             38396500.38

Threads fairness:
    events (avg/stddev):           49665.2969/162.88
    execution time (avg/stddev):   599.9453/0.01